#include "books.h"

namespace STORE {
namespace Books {

/*********************************************************************/
// Модель
Model::Model( QObject *parent)
    : QSqlQueryModel ( parent ) {

}

/*-------------------------------------------------------------------*/

Model::~Model(){
}

/*********************************************************************/
// Представление
View::View( QWidget *parent )
    : QTableView( parent ) {

}

/*-------------------------------------------------------------------*/

View::~View() {
}

/*********************************************************************/

} // namespace Books
} // namespace STORE
